cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'johanhaleby/kubetail'

# Cask
cask 'adium'
cask 'appcleaner'
cask 'dash'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'iterm2'
cask 'omnifocus'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'steermouse'
cask 'vagrant'
cask 'virtualbox-extension-pack'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'wireshark'

# Fonts
cask 'font-hack'
cask 'font-fontawesome'

# Packages
brew 'ansible'
brew 'bash-completion'
brew 'diff-so-fancy'
brew 'docker-machine-driver-hyperkit'
brew 'docker-machine'
brew 'docker'
brew 'fping'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'go'
brew 'gopass'
brew 'jq'
brew 'kubectl'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubetail'
brew 'nmap'
brew 'opensc'
brew 'packer'
brew 'pandoc'
brew 'pbzip2'
brew 'pigz'
brew 'pinentry-mac'
brew 'pv'
brew 'qemu'
brew 'rke'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'wakeonlan'
brew 'wget'
brew 'xz'

# Mac App Store
# Install Apps from the AppStore
mas 'Slack', id: 803453959
mas 'Microsoft Remote Desktop', id: 715768417
mas 'LastPass', id: 926036361
mas 'MuteMyMic', id: 456362093
mas 'mindnode-5', id: 1289197285
